app/controllers/school_classes_controller.rb

  def update
	  @school_class = SchoolClass.find(params[:id])
	  @school_class.update(title: params[:title], description: params[:description])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-04-18 17:03:51.086608"], ["id", 1]]