app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-04-18 16:31:50.149939"], ["updated_at", "2018-04-18 16:31:50.149939"]]
---
  def create
    @student = Student.new(params.required(:student).permit(:first_name, :last_name))
    @student.save